<template>
    <head-nav></head-nav>
    <div class="main_bg">
        <div class="content">
            <div class="leftConten">
                <div class="retrieval">
                    <div class="ancient">
                        <h5>古代文明</h5>
                        <span @click="filterateData('loc', item.name)" :class="item.name === activeData ? 'active' : ''"
                            v-for="item in ancientData" :key="item.id">
                            {{ item.name }}</span>
                    </div>
                    <div class="ancient">
                        <h5>质地</h5>
                        <span @click="filterateData('type', item.name)" :class="item.name === activeData ? 'active' : ''"
                            v-for="item in texture" :key="item.id">
                            {{ item.name }}</span>
                    </div>
                    <div class="ancient">
                        <h5>制造者</h5>
                        <span @click="filterateData('mfr', item.name)" :class="item.name === activeData ? 'active' : ''"
                            v-for="item in maker" :key="item.id">
                            {{ item.name }}</span>
                    </div>
                </div>

            </div>
            <div class="rightConten">
                <div class="retrieval imgData">
                    <div @click="imgInfo(item)" v-for="item in imgDataList" :key="item" class="imgBox">
                        <img :src="getlistImg(item.sn)" />

                    </div>
                </div>

            </div>
        </div>

    </div>
    <div class="dialog" v-show="dialogVisible">
        <div class="dialog_bg">
            <div class="dialog_content">
                <div class="left_img_box">
                    <div class="left_imgs">
                        <!-- <img :src="getlistImg(fliterImg.sn)" /> -->
                        <img v-if="isFront" :src="getlistImg(fliterImg.sn)" />
                        <img v-else="!isFront" :src="getImg(fliterImg.sn)" />
                    </div>
                    <div class="reduce">
                        <div @click="checkBtn(true)" class="img" :class="isFront ? 'active' : ''">
                            <img :src="getlistImg(fliterImg.sn)" />
                        </div>
                        <div @click="checkBtn(false)" class="img" :class="isFront ? '' : 'active'">
                            <img :src="getImg(fliterImg.sn)" />
                        </div>

                    </div>
                </div>
                <div class="right_content">
                    <div class="form">
                        <div class="form_item">
                            <span class="icon number"></span>
                            <a> 编号 | {{ fliterImg.sn }}</a>
                        </div>
                        <div class="form_item">
                            <span class="icon loc"></span>
                            <a> 文明 | {{ fliterImg.loc }}</a>
                        </div>
                        <div class="form_item" style="width: 80%;">
                            <span class="icon mfr"></span>
                            <a> 生产者 | {{ fliterImg.mfr }}</a>
                        </div>
                        <div class="form_item type">
                            <span class="icon type"></span>
                            <a> 质地 | {{ fliterImg.type }}</a>
                        </div>
                        <div class="form_item">
                            <span class="icon loc"></span>
                            <a> 起始时间 | {{ fliterImg.dateb }} ~ {{ fliterImg.datee }}</a>
                        </div>
                        <div class="form_item d">
                            <span class="icon d"></span>
                            <a> 直径 | {{ fliterImg.d }} </a>
                        </div>
                        <div class="form_item w">
                            <span class="icon w"></span>
                            <a> 重量 | {{ fliterImg.w }} </a>
                        </div>
                    </div>
                    <div class="nameBox">
                        <div class="text">
                            <h3>{{ fliterImg.name }}</h3>
                            <h5>{{ fliterImg.subhead }}</h5>
                        </div>
                    </div>
                    <div class="descBox">
                        {{ fliterImg.desc }}
                    </div>

                </div>


            </div>
            <div class="dialogclose" @click="closeDialog">
            </div>
        </div>

    </div>
</template>
    
<script setup>
import headNav from '@/components/headNav.vue';
import { reactive, onMounted, onUpdated, ref } from 'vue'
const getlistImg = (name) => {
    return `/src/assets/all/coin_icon/${name}_z.png`
}
const getImg = (name) => {
    return `/src/assets/all/coin_icon/${name}_b.png`
}
const activeData = ref('全部')
const filterateData = (type, data) => {
    console.log(data)
    activeData.value = data
    pushTrue.value = false
    imgDataList.length = 0
    if (data === '全部') {
        pushTrue.value = true
        imgLenth.value = 12
        dataList.slice(0, imgLenth.value).forEach((i) => {
            imgDataList.push(i)
        })
    } else {
        console.log(imgDataList.length)
        dataList.forEach((i) => {
            if (String(i[type]) === String(data)) {
                imgDataList.push(i)
            }
        })
    }

    console.log(imgDataList.length)
}
const pushTrue = ref(true)
const ancientData = [
    { id: 'all', name: '全部' },
    { id: 'bzt', name: '拜占庭' },
    { id: 'bs', name: '波斯' },
    { id: 'lm', name: '罗马' },
    { id: 'yd', name: '雅典' },
    { id: 'gyd', name: '古印度' },
    { id: 'gzl', name: '古中亚' },
    { id: 'ysl', name: '伊斯兰' },
    { id: 'ss', name: '萨珊' },

]
const texture = [
    { id: 'all', name: '全部' },
    { id: 'jin', name: '金' },
    { id: 'yin', name: '银' },
    { id: 'tong', name: '铜' },
]
const maker = [
    { id: 'all', name: '全部' },
    { id: 'bbl', name: '巴比伦造币厂' },
    { id: 'yysd', name: '亚历山大造币厂' },
    { id: 'ad', name: '安蒂奥克造币厂打制' },
    { id: 'yd', name: '雅典城' },
    { id: 'lp', name: '兰普萨柯斯造币厂' },
    { id: 'mqd', name: '马其顿行省' },
    { id: 'af', name: '安菲波利造币厂' },
    { id: 'aqh', name: '爱琴海北部萨索斯岛' },
    { id: 'pjm', name: '帕加马王国或当地总督' },
    { id: 'unknow', name: '未知' },
]
const dataList = [
    {
        sn: "79613",
        loc: "希腊",
        name: "马其顿王国腓力三世",
        subhead: "1斯塔特金币",
        type: "金",
        dateb: "-323",
        datee: "-317",
        datez: "",
        mfr: "巴比伦造币厂",
        d: "18.5",
        dz: "",
        w: "8.5",
        desc: "正面为戴柯林斯盔雅典娜神像；背面为双翼胜利女神手持一船桅杆站像，下方有字母“ΛY”，右侧是国王名“BAΣIΛEΩΣ ΦIΛIΠΠOY”（国王腓力）。",
    },
    {
        sn: "79622",
        loc: "希腊",
        name: "托勒密王国托勒密二世",
        subhead: "4德拉克马银币",
        type: "银",
        dateb: "-285",
        datee: "-246",
        datez: "",
        mfr: "亚历山大造币厂",
        d: "27",
        dz: "",
        w: "13.6",
        desc: "正面为国王托勒密二世头像；背面为抓着闪电杖的猎鹰，前面有一圆盾；外侧有希腊文“ΠTOΛEMAIOY BAΣIΛEΩΣ”（托勒密国王）。",
    },
    {
        sn: "79623",
        loc: "希腊",
        name: "塞琉古王国安条克七世",
        subhead: "4德拉克马银币",
        type: "银",
        dateb: "-138",
        datee: "-129",
        datez: "",
        mfr: "未知",
        d: "29.5",
        dz: "",
        w: "16.1",
        desc: "正面国王束头带面右头像；背面为雅典娜，一手托奈克女神，一手持杖，面左而立，左右希腊文“BAΣIΛEΩΣ ANTIOXOY EYEIΓETOY”（仁慈的安条克国王）。",
    },
    {
        sn: "79624",
        loc: "希腊",
        name: "塞琉古王国安条克八世",
        subhead: "4德拉克马银币",
        type: "银",
        dateb: "-121",
        datee: "-113",
        datez: "",
        mfr: "安蒂奥克造币厂打制",
        d: "30.5",
        dz: "",
        w: "16.7",
        desc: "正面为国王安条克八世头像。背面为手持芒星和手杖的宙斯神像，脚下有一盾牌；两侧是希腊文“BAΣIΛEΩΣ ANTIOXOY EΠIΦANOYΣ”（高贵的安条克国王）。",
    },
    {
        sn: "79625",
        loc: "希腊",
        name: "塞琉古王国腓力一世",
        subhead: "4德拉克马银币",
        type: "银",
        dateb: "-98",
        datee: "-83",
        datez: "",
        mfr: "安蒂奥克造币厂打制",
        d: "27",
        dz: "",
        w: "15.4",
        desc: "正面为国王腓力一世头像；背面为手持胜利女神和权杖的宙斯坐像。两侧是希腊文“BAΣIΛEΩΣ ΦIΛIΠΠOY EΠΦANOYΣ ΦIΛAΔEΛΦOY”（高贵的爱兄弟的腓力国王）。",
    },
    {
        sn: "79626",
        loc: "希腊",
        name: "塞琉古王国亚历山大二世",
        subhead: "4德拉克马银币",
        type: "银",
        dateb: "-128",
        datee: "-123",
        datez: "",
        mfr: "安蒂奥克造币厂打制",
        d: "28.5",
        dz: "",
        w: "16",
        desc: "正面是亚历山大二世像，外有珠圈；背面是宙斯坐像，一手持胜利女神，一手持权杖，两侧是希腊文“BAΣIΛEΩΣ ΑΛΕΞΑΝΔΡΟΥ”（亚历山大国王）。",
    },
    {
        sn: "79627",
        loc: "希腊",
        name: "马其顿王国亚历山大大帝（在世版）",
        subhead: "4德拉克马银币",
        type: "银",
        dateb: "-336",
        datee: "-323",
        datez: "",
        mfr: "未知",
        d: "26.4",
        dz: "",
        w: "17.2",
        desc: "正面为戴狮皮盔大力神赫拉克勒斯头像，背面为左手持杖右手托持鹰宙斯坐像，侧面有“ΑΛΕΞΑΝΔΡΟΥ”（亚历山大）。",
    },
    {
        sn: "79628",
        loc: "希腊",
        name: "雅典城",
        subhead: "4德拉克马银币",
        type: "银",
        dateb: "-480",
        datee: "-475",
        datez: "",
        mfr: "雅典城",
        d: "25",
        dz: "",
        w: "17.2",
        desc: "正面为雅典城守护神雅典娜戴橄榄枝花环阿提卡式头盔头像；背面为猫头鹰、橄榄枝、新月和雅典的缩写文字“ΑΘΕ”。雅典娜是战神、智慧之神和雅典城的守护神。猫头鹰是雅典城的守护鸟，为雅典娜传递消息，是智慧的象征。早期猫头鹰银币没有花环装饰。公元前480年以后，猫头鹰银币在雅典娜阿提卡式头盔上装饰橄榄枝花环，据说是为了纪念希腊人战胜薛西斯波斯大军。这是雅典鼎盛时期的主要货币，也是地中海地区的硬通货。",
    },
    {
        sn: "79629",
        loc: "希腊",
        name: "色雷斯王国利西马科斯",
        subhead: "4德拉克马银币",
        type: "银",
        dateb: "-297",
        datee: "-281",
        datez: "",
        mfr: "兰普萨柯斯（Lampsacus）造币厂",
        d: "29",
        dz: "",
        w: "16.8",
        desc: "正面为亚历山大大帝戴阿蒙神公羊角像，背面为手持胜利女神和长矛的雅典娜坐像，右下方有一盾牌，座位下有一个月牙纹，两侧有希腊文“ΛYΣIMAXOY BAΣIΛEΩΣ”（利西马科斯国王）。",
    },
    {
        sn: "79630",
        loc: "希腊",
        name: "马其顿行省财务官埃西拉斯",
        subhead: "4德拉克马银币",
        type: "银",
        dateb: "-95",
        datee: "-70",
        datez: "",
        mfr: "马其顿行省",
        d: "27.5",
        dz: "",
        w: "16.2",
        desc: "正面为神化的亚历山大大帝侧面像，发后有“Θ”字母。背面是花环环绕的一组钱柜、棍棒、凳子；上有“AESILLAS”，下方有字母“q”，是财务官的缩写。",
    },
    {
        sn: "79631",
        loc: "希腊",
        name: "马其顿行省普鲁斯特",
        subhead: "4德拉克马银币",
        type: "银",
        dateb: "-158",
        datee: "-149",
        datez: "",
        mfr: "安菲波利造币厂",
        d: "33",
        dz: "",
        w: "16.9",
        desc: "正面为阿尔忒弥斯女神侧面头像；背面为橡叶环与棍棒，希腊语地名“MAKEΔONΩN ΠPΩTHΣ”，意思是马其顿普鲁斯特。罗马管辖下的马其顿王朝有4个自治区，普鲁斯特是其中的一个。",
    },
    {
        sn: "79632",
        loc: "希腊",
        name: "萨索斯岛酒神狄奥尼索斯",
        subhead: "4德拉克马银币",
        type: "银",
        dateb: "-148",
        datee: "-80",
        datez: "",
        mfr: "爱琴海北部萨索斯岛",
        d: "28.42",
        dz: "",
        w: "15.94",
        desc: "正面为酒神狄俄尼索斯（Dionysos）戴葡萄藤花冠头像；背面为大力神赫拉克勒斯（Herakles）手持狼牙棒和狮子皮站像，周围有希腊文“ΣΩTHPOΣ HPAKΛEOYΣ”，意为“救世主赫拉克勒斯”，还有两个“M”造币厂名缩写。脚线下铭文为地名“ΘΛΞIΩN”（萨索斯）。",
    },
    {
        sn: "79633",
        loc: "希腊",
        name: "帕加马蛇篮图",
        subhead: "4德拉克马银币",
        type: "银",
        dateb: "-200",
        datee: "-100",
        datez: "世纪",
        mfr: "帕加马王国或当地总督",
        d: "27.5",
        dz: "",
        w: "12.7",
        desc: "在西方，蛇象征健康和医疗。这种蛇篮银币是当时希腊东部地区的硬通货，先后有20多个城邦打制这一图案的银币。",
    },
    {
        sn: "79634",
        loc: "希腊",
        name: "塞琉古独立城市塞琉西亚",
        subhead: "4德拉克马银币",
        type: "银",
        dateb: "-95",
        datee: "-94",
        datez: "",
        mfr: "未知",
        d: "31",
        dz: "",
        w: "14.2",
        desc: "正面为幸运女神像；背面为宙斯雷电、绶带及支架，上面是“ΣEΛEVKEΩN THΣ IEPAΣ”，下面是“KAI AVTONOMOV”。在支架脚之间有“EI”，表示打制年份15，即公元前95～前94年，底下有“Δ”，周围有花环。塞琉西亚（Seleukeia）是Pieria山脚下一个重要的海滨城市，是塞琉古一世于公元前300年营建的。作为安条克的外港城市和要塞，塞琉西亚于公元前109～前108年成为独立的城市。",
    },
    {
        sn: "79635",
        loc: "希腊",
        name: "塞琉古王朝德米特里乌斯",
        subhead: "4德拉克马银币",
        type: "银",
        dateb: "-129",
        datee: "-126",
        datez: "",
        mfr: "未知",
        d: "28",
        dz: "",
        w: "16.2",
        desc: "null",
    },
    {
        sn: "79636",
        loc: "希腊",
        name: "托勒密王国托勒密六世",
        subhead: "4德拉克马银币",
        type: "银",
        dateb: "-164",
        datee: "-163",
        datez: "",
        mfr: "塞浦路斯帕福斯造币厂",
        d: "26.2",
        dz: "",
        w: "14",
        desc: "正面国王束头带面右头像；背面雄鹰抓握霹雳。左侧有字母LKA，KA是希腊数字21，意思是即位的第21年，托勒密六世即位是公元前180年，因此，就是前164～前163年。右侧有字母ΠA，是“Paphos”（帕福斯造币厂），外侧有国王托勒密的希腊语“（ΠT）OΛEMAIOY BAΣIΛEΩΣ”。",
    },
    {
        sn: "79637",
        loc: "希腊",
        name: "伊鲁雷亚阿波罗尼亚奶牛和狼",
        subhead: "1德拉克马（Drachma）银币",
        type: "银",
        dateb: "-450",
        datee: "-350",
        datez: "",
        mfr: "未知",
        d: "17.5",
        dz: "",
        w: "3",
        desc: "伊鲁雷亚币（伊鲁雷亚位于希腊伊庇鲁斯北部，马其顿的西部）。",
    },
    {
        sn: "79638",
        loc: "希腊",
        name: "黑海阿波罗尼亚美杜莎",
        subhead: "4奥波银币",
        type: "银",
        dateb: "-500",
        datee: "-401",
        datez: "世纪",
        mfr: "色雷斯阿波罗尼亚（Pontika）",
        d: "13",
        dz: "",
        w: "2.9",
        desc: "面值4奥波（1obol=0.71克）。正面蛇发女妖美杜莎；背面是船锚、龙虾（crayfish）和地名阿波罗尼亚的首字母缩写“Λ”。阿波罗尼亚是一座古老的黑海海滨城市，意为“海上的阿波罗城”，公元前7世纪由色雷斯人建立。",
    },
    {
        sn: "79614",
        loc: "罗马",
        name: "罗马将帅时期科松王国",
        subhead: "1斯塔特金币",
        type: "金",
        dateb: "-60",
        datee: "-40",
        datez: "世纪中叶",
        mfr: "未知",
        d: "21",
        dz: "",
        w: "8.3",
        desc: "正面为三人像，中间是古罗马执行官，前后二人是手持束斧杖的护卫官；左下角是“BA”国王缩写，横线下希腊文“KOΣΩN”（科松）。背面是一站鹰立在权杖上，另一爪抓一花环。",
    },
    {
        sn: "79639",
        loc: "罗马",
        name: "罗马共和国罗马女神",
        subhead: "1第纳尔银币",
        type: "银",
        dateb: "-152",
        datee: "-152",
        datez: "",
        mfr: "未知",
        d: "18",
        dz: "",
        w: "3.9",
        desc: "正面为戴盔罗马女神侧面头像；背面为维多利亚女神驾两驾马车，下面是拉丁文制币官名“CCAT”和“ROMA”（罗马）。",
    },
    {
        sn: "79660",
        loc: "罗马",
        name: "罗马帝国菲力普一世",
        subhead: "1安敦尼银币",
        type: "银",
        dateb: "244",
        datee: "249",
        datez: "",
        mfr: "罗马造币厂",
        d: "22.5",
        dz: "",
        w: "4.6",
        desc: "正面菲力普一世芒冠侧面像拉丁文名号及头衔；背面为手持丰饶角和双头蛇杖的幸运女神像及币文。",
    },
    {
        sn: "79661",
        loc: "罗马",
        name: "罗马帝国菲力普一世",
        subhead: "4德拉克马银币",
        type: "银",
        dateb: "248",
        datee: "248",
        datez: "",
        mfr: "安条克造币厂",
        d: "25.5",
        dz: "",
        w: "11.6",
        desc: "正面是菲力普一世芒冠像希腊文名号及头衔，背面为站鹰图及希腊币文。",
    },
    {
        sn: "79662",
        loc: "罗马",
        name: "罗马帝国德西乌斯",
        subhead: "1安敦尼银币",
        type: "银",
        dateb: "249",
        datee: "251",
        datez: "",
        mfr: "罗马造币厂",
        d: "22",
        dz: "",
        w: "3.9",
        desc: "正面德西乌斯芒冠侧面像，外围拉丁文“IMP C M Q TRAIANVS DECIVS AVG”（最高统帅凯乌斯 马西乌斯 奎伊图斯 图拉真 德西乌斯 奥古斯都）；背面是德西乌斯骑像，币文为“ADVANTVS AVG”（奥古斯都莅临）。德西乌斯是菲力普在位后期的罗马市长。公元248年，他率军平定帕卡提亚努斯的多瑙河军团叛乱，得胜后被将士们拥立为皇帝。在回罗马的途中，与菲力普大战并获胜，从而取代菲力普成为罗马皇帝。 ",
    },
    {
        sn: "79663",
        loc: "罗马",
        name: "罗马帝国加卢斯",
        subhead: "1安敦尼银币",
        type: "银",
        dateb: "251",
        datee: "253",
        datez: "",
        mfr: "罗马造币厂",
        d: "21.5",
        dz: "",
        w: "4.3",
        desc: "正面加卢斯芒冠侧面像及拉丁文名号；背面是手持花环的胜利女神站像及币文。 ",
    },
    {
        sn: "79664",
        loc: "罗马",
        name: "罗马帝国波斯图穆斯",
        subhead: "1安敦尼银币",
        type: "银",
        dateb: "260",
        datee: "269",
        datez: "",
        mfr: "未知",
        d: "23.5",
        dz: "",
        w: "3.7",
        desc: "正面为皇帝波斯图穆斯头像与名号及头衔；背面为手持权杖和祭盘的虔诚女神站像及币文。 ",
    },
    {
        sn: "79665",
        loc: "罗马",
        name: "罗马帝国图拉真",
        subhead: "1第纳尔银币",
        type: "银",
        dateb: "98",
        datee: "117",
        datez: "",
        mfr: "未知",
        d: "18",
        dz: "",
        w: "3.5",
        desc: "正面为皇帝图拉真月桂冠头像与拉丁文铭文，意为“最高统帅 图拉真 奥古斯都 日尔曼征服者 大祭司 保民官”；背面为胜利女神站像及币文。 ",
    },
    {
        sn: "79666",
        loc: "罗马",
        name: "罗马帝国哈德良",
        subhead: "1第纳尔银币",
        type: "银",
        dateb: "117",
        datee: "138",
        datez: "",
        mfr: "罗马造币厂",
        d: "16.5",
        dz: "",
        w: "2.6",
        desc: "正面为皇帝哈德良头像与名称头衔，背面为胜利女神。 ",
    },
    {
        sn: "79667",
        loc: "罗马",
        name: "罗马帝国马克西米努斯",
        subhead: "1安敦尼银币",
        type: "银",
        dateb: "235",
        datee: "238",
        datez: "",
        mfr: "罗马造币厂",
        d: "19.5",
        dz: "",
        w: "3.2",
        desc: "正面为皇帝马克西米努斯头像与拉丁文名号及头衔；背面为健康女神坐像及币文。 ",
    },
    {
        sn: "79668",
        loc: "罗马",
        name: "罗马帝国塞维鲁",
        subhead: "1第纳尔银币",
        type: "银",
        dateb: "193",
        datee: "211",
        datez: "",
        mfr: "罗马造币厂",
        d: "18.5",
        dz: "",
        w: "3.7",
        desc: "正面为皇帝塞维鲁头像与拉丁文名号及头衔“塞维鲁 虔诚者 奥古斯都”；背面为健康女神站像和拉丁文币文，意为“大祭司 保民官 三届执政官 国父”。 ",
    },
    {
        sn: "79669",
        loc: "罗马",
        name: "罗马帝国多姆娜",
        subhead: "1第纳尔银币",
        type: "银",
        dateb: "193",
        datee: "211",
        datez: "",
        mfr: "未知",
        d: "20.5",
        dz: "",
        w: "3.4",
        desc: "正面为皇帝尤莉亚·多姆娜皇后头像与名称头衔，背面为罗马女神坐像。尤莉亚·多姆娜是皇帝塞普提米乌斯·塞维鲁的皇后。 ",
    },
    {
        sn: "79670",
        loc: "罗马",
        name: "罗马帝国卡拉卡拉",
        subhead: "1第纳尔银币",
        type: "银",
        dateb: "211",
        datee: "217",
        datez: "",
        mfr: "罗马造币厂",
        d: "18.5",
        dz: "",
        w: "2.9",
        desc: "正面为皇帝卡拉卡拉月桂冠头像与拉丁文名号及头衔；背面为自由神站像和币文。卡拉卡拉是塞维鲁与多姆娜的大儿子。公元211年，与他的兄弟盖塔一起被拥立为共治帝。 ",
    },
    {
        sn: "79671",
        loc: "罗马",
        name: "罗马帝国盖塔",
        subhead: "1第纳尔银币",
        type: "银",
        dateb: "209",
        datee: "212",
        datez: "",
        mfr: "罗马造币厂",
        d: "20",
        dz: "",
        w: "3.1",
        desc: "正面为共治皇帝盖塔头像与拉丁文名号及头衔；背面为天意神站像及币文。盖塔是塞维鲁和多姆娜的小儿子，公元211年与卡拉卡拉共同执政10个月后被谋杀。 ",
    },
    {
        sn: "79672",
        loc: "罗马",
        name: "罗马帝国卡拉卡拉",
        subhead: "1第纳尔银币",
        type: "银",
        dateb: "209",
        datee: "212",
        datez: "",
        mfr: "罗马造币厂",
        d: "18",
        dz: "",
        w: "3.1",
        desc: "正面为卡拉卡拉儿时头像与拉丁文名号及头衔；背图为卡拉卡拉与弟弟盖塔站像及币文。因卡拉卡拉谋杀盖塔后，在罗马境内实行记忆消失法，凡盖塔的画像与雕塑全部销毁。 ",
    },
    {
        sn: "79673",
        loc: "罗马",
        name: "罗马帝国埃拉伽巴努斯",
        subhead: "1第纳尔银币",
        type: "银",
        dateb: "217",
        datee: "222",
        datez: "",
        mfr: "罗马造币厂",
        d: "18.5",
        dz: "",
        w: "2.9",
        desc: "正面为皇帝埃拉伽巴努斯头像与拉丁文名号及头衔；背面为幸运神站像与币文。 ",
    },
    {
        sn: "79674",
        loc: "罗马",
        name: "罗马帝国亚历山大·塞维鲁",
        subhead: "1第纳尔银币",
        type: "银",
        dateb: "222",
        datee: "235",
        datez: "",
        mfr: "罗马造币厂",
        d: "20",
        dz: "",
        w: "2.8",
        desc: "正面为皇帝亚历山大·塞维鲁头像与拉丁文名号及头衔；背面为财富女神站像及币文。 ",
    },
    {
        sn: "79675",
        loc: "罗马",
        name: "罗马帝国索阿耶米亚斯",
        subhead: "1第纳尔银币",
        type: "银",
        dateb: "null",
        datee: "null",
        datez: "不详",
        mfr: "未知",
        d: "19",
        dz: "",
        w: "3.2",
        desc: "正面是皇太后索阿耶米亚斯像，外围铭文是“IVLIA SOANMIAS AVG”（朱丽娅 索阿耶米亚斯 奥古斯塔），背面的维纳斯神站像及币文。索阿耶米亚斯是埃拉伽巴努斯之母，公元222年与子被禁卫军谋杀 ",
    },
    {
        sn: "79676",
        loc: "罗马",
        name: "罗马帝国朱丽娅·马伊莎",
        subhead: "1第纳尔银币",
        type: "银",
        dateb: "217",
        datee: "222",
        datez: "",
        mfr: "安蒂奥克造币厂打制",
        d: "22",
        dz: "",
        w: "4.8",
        desc: "正面是朱丽娅像，外围拉丁文名号为“IVLIA MAESA AVG”（朱丽娅 马伊莎 奥古斯塔）；背面虔诚女神站像及币文“PIETAS AVG”（虔诚者 奥古斯塔）。朱丽娅·马伊莎是皇帝埃拉伽巴努斯和亚历山大·塞维鲁的外祖母。 ",
    },
    {
        sn: "79677",
        loc: "罗马",
        name: "罗马帝国加里恩努斯",
        subhead: "1安敦尼银币",
        type: "银",
        dateb: "253",
        datee: "268",
        datez: "",
        mfr: "罗马造币厂",
        d: "21.5",
        dz: "",
        w: "4.3",
        desc: "正面是加里恩努斯芒冠像，外围拉丁文“GALLIENVS AVG”（加里恩努斯 奥古斯都）；背面是大力神像及币文。 ",
    },
    {
        sn: "79678",
        loc: "罗马",
        name: "罗马帝国萨罗丽娜",
        subhead: "1安敦尼银币",
        type: "银",
        dateb: "253",
        datee: "268",
        datez: "",
        mfr: "罗马造币厂",
        d: "24",
        dz: "",
        w: "3.6",
        desc: "正面是皇帝加里恩努斯之妻萨罗丽娜侧面像及拉丁文名号；背面是维纳斯神站像及币文。 ",
    },
    {
        sn: "79679",
        loc: "罗马",
        name: "罗马帝国塔西佗",
        subhead: "1安敦尼银币",
        type: "银",
        dateb: "275",
        datee: "276",
        datez: "",
        mfr: "未知",
        d: "23.5",
        dz: "",
        w: "3.7",
        desc: "正面是塔西佗芒冠像，外围拉丁文“IMP C M CL TACITVS AVG”（最高统帅 凯撒 塔西陀 奥古斯都）；背面是天意女神站像及币文。 ",
    },
    {
        sn: "79640",
        loc: "罗马",
        name: "罗马帝国戈尔迪安三世",
        subhead: "1安敦尼银币-阿波罗",
        type: "银",
        dateb: "238",
        datee: "244",
        datez: "",
        mfr: "安蒂奥克造币厂",
        d: "23",
        dz: "",
        w: "4.6",
        desc: "正面是年轻的戈尔迪安三世芒冠像，外围铭文是“最高统帅 凯撒 戈尔迪安 奥古斯都”，背面有多种神像，如阿波罗、胜利女神、远见女神、幸运女神、慷慨女神、英勇之神、朱庇特等。 ",
    },
    {
        sn: "79641",
        loc: "罗马",
        name: "罗马帝国戈尔迪安三世",
        subhead: "1安敦尼银币-胜利女神",
        type: "银",
        dateb: "238",
        datee: "244",
        datez: "",
        mfr: "安蒂奥克造币厂",
        d: "23",
        dz: "",
        w: "4.6",
        desc: "正面是年轻的戈尔迪安三世芒冠像，外围铭文是“最高统帅 凯撒 戈尔迪安 奥古斯都”，背面有多种神像，如阿波罗、胜利女神、远见女神、幸运女神、慷慨女神、英勇之神、朱庇特等。 ",
    },
    {
        sn: "79642",
        loc: "罗马",
        name: "罗马帝国戈尔迪安三世",
        subhead: "1安敦尼银币-胜利女神",
        type: "银",
        dateb: "238",
        datee: "244",
        datez: "",
        mfr: "安蒂奥克造币厂",
        d: "21.5",
        dz: "",
        w: "5.4",
        desc: "正面是年轻的戈尔迪安三世芒冠像，外围铭文是“最高统帅 凯撒 戈尔迪安 奥古斯都”，背面有多种神像，如阿波罗、胜利女神、远见女神、幸运女神、慷慨女神、英勇之神、朱庇特等。 ",
    },
    {
        sn: "79643",
        loc: "罗马",
        name: "罗马帝国戈尔迪安三世",
        subhead: "1安敦尼银币-戈尔迪安三世",
        type: "银",
        dateb: "238",
        datee: "244",
        datez: "",
        mfr: "安蒂奥克造币厂",
        d: "23",
        dz: "",
        w: "5.4",
        desc: "正面是年轻的戈尔迪安三世芒冠像，外围铭文是“最高统帅 凯撒 戈尔迪安 奥古斯都”，背面有多种神像，如阿波罗、胜利女神、远见女神、幸运女神、慷慨女神、英勇之神、朱庇特等。 ",
    },
    {
        sn: "79644",
        loc: "罗马",
        name: "罗马帝国戈尔迪安三世",
        subhead: "1安敦尼银币-永恒女神",
        type: "银",
        dateb: "238",
        datee: "244",
        datez: "",
        mfr: "安蒂奥克造币厂",
        d: "22",
        dz: "",
        w: "4.5",
        desc: "正面是年轻的戈尔迪安三世芒冠像，外围铭文是“最高统帅 凯撒 戈尔迪安 奥古斯都”，背面有多种神像，如阿波罗、胜利女神、远见女神、幸运女神、慷慨女神、英勇之神、朱庇特等。 ",
    },
    {
        sn: "79645",
        loc: "罗马",
        name: "罗马帝国戈尔迪安三世",
        subhead: "1安敦尼银币-慷慨女神",
        type: "银",
        dateb: "238",
        datee: "244",
        datez: "",
        mfr: "安蒂奥克造币厂",
        d: "22",
        dz: "",
        w: "4.4",
        desc: "正面是年轻的戈尔迪安三世芒冠像，外围铭文是“最高统帅 凯撒 戈尔迪安 奥古斯都”，背面有多种神像，如阿波罗、胜利女神、远见女神、幸运女神、慷慨女神、英勇之神、朱庇特等。 ",
    },
    {
        sn: "79646",
        loc: "罗马",
        name: "罗马帝国戈尔迪安三世",
        subhead: "1安敦尼银币-英勇之神",
        type: "银",
        dateb: "238",
        datee: "244",
        datez: "",
        mfr: "安蒂奥克造币厂",
        d: "22",
        dz: "",
        w: "4.5",
        desc: "正面是年轻的戈尔迪安三世芒冠像，外围铭文是“最高统帅 凯撒 戈尔迪安 奥古斯都”，背面有多种神像，如阿波罗、胜利女神、远见女神、幸运女神、慷慨女神、英勇之神、朱庇特等。 ",
    },
    {
        sn: "79647",
        loc: "罗马",
        name: "罗马帝国戈尔迪安三世",
        subhead: "1安敦尼银币-朱庇特",
        type: "银",
        dateb: "238",
        datee: "244",
        datez: "",
        mfr: "安蒂奥克造币厂",
        d: "23",
        dz: "",
        w: "4.3",
        desc: "正面是年轻的戈尔迪安三世芒冠像，外围铭文是“最高统帅 凯撒 戈尔迪安 奥古斯都”，背面有多种神像，如阿波罗、胜利女神、远见女神、幸运女神、慷慨女神、英勇之神、朱庇特等。 ",
    },
    {
        sn: "79648",
        loc: "罗马",
        name: "罗马帝国戈尔迪安三世",
        subhead: "1安敦尼银币-安全女神",
        type: "银",
        dateb: "238",
        datee: "244",
        datez: "",
        mfr: "安蒂奥克造币厂",
        d: "23.5",
        dz: "",
        w: "3.7",
        desc: "正面是年轻的戈尔迪安三世芒冠像，外围铭文是“最高统帅 凯撒 戈尔迪安 奥古斯都”，背面有多种神像，如阿波罗、胜利女神、远见女神、幸运女神、慷慨女神、英勇之神、朱庇特等。 ",
    },
    {
        sn: "79649",
        loc: "罗马",
        name: "罗马帝国戈尔迪安三世",
        subhead: "1安敦尼银币-阿波罗",
        type: "银",
        dateb: "238",
        datee: "244",
        datez: "",
        mfr: "安蒂奥克造币厂",
        d: "22",
        dz: "",
        w: "4.1",
        desc: "正面是年轻的戈尔迪安三世芒冠像，外围铭文是“最高统帅 凯撒 戈尔迪安 奥古斯都”，背面有多种神像，如阿波罗、胜利女神、远见女神、幸运女神、慷慨女神、英勇之神、朱庇特等。 ",
    },
    {
        sn: "79650",
        loc: "罗马",
        name: "罗马帝国戈尔迪安三世",
        subhead: "1安敦尼银币-大力神",
        type: "银",
        dateb: "238",
        datee: "244",
        datez: "",
        mfr: "安蒂奥克造币厂",
        d: "22",
        dz: "",
        w: "4.1",
        desc: "正面是年轻的戈尔迪安三世芒冠像，外围铭文是“最高统帅 凯撒 戈尔迪安 奥古斯都”，背面有多种神像，如阿波罗、胜利女神、远见女神、幸运女神、慷慨女神、英勇之神、朱庇特等。 ",
    },
    {
        sn: "79651",
        loc: "罗马",
        name: "罗马帝国戈尔迪安三世",
        subhead: "1安敦尼银币-戈尔迪安三世",
        type: "银",
        dateb: "238",
        datee: "244",
        datez: "",
        mfr: "安蒂奥克造币厂",
        d: "22.5",
        dz: "",
        w: "4",
        desc: "正面是年轻的戈尔迪安三世芒冠像，外围铭文是“最高统帅 凯撒 戈尔迪安 奥古斯都”，背面有多种神像，如阿波罗、胜利女神、远见女神、幸运女神、慷慨女神、英勇之神、朱庇特等。 ",
    },
    {
        sn: "79652",
        loc: "罗马",
        name: "罗马帝国戈尔迪安三世",
        subhead: "1安敦尼银币-战神",
        type: "银",
        dateb: "238",
        datee: "244",
        datez: "",
        mfr: "安蒂奥克造币厂",
        d: "22",
        dz: "",
        w: "3.2",
        desc: "正面是年轻的戈尔迪安三世芒冠像，外围铭文是“最高统帅 凯撒 戈尔迪安 奥古斯都”，背面有多种神像，如阿波罗、胜利女神、远见女神、幸运女神、慷慨女神、英勇之神、朱庇特等。 ",
    },
    {
        sn: "79653",
        loc: "罗马",
        name: "罗马帝国戈尔迪安三世",
        subhead: "1安敦尼银币-阿波罗",
        type: "银",
        dateb: "238",
        datee: "244",
        datez: "",
        mfr: "安蒂奥克造币厂",
        d: "22",
        dz: "",
        w: "3.8",
        desc: "正面是年轻的戈尔迪安三世芒冠像，外围铭文是“最高统帅 凯撒 戈尔迪安 奥古斯都”，背面有多种神像，如阿波罗、胜利女神、远见女神、幸运女神、慷慨女神、英勇之神、朱庇特等。 ",
    },
    {
        sn: "79654",
        loc: "罗马",
        name: "罗马帝国戈尔迪安三世",
        subhead: "1安敦尼银币-协和女神",
        type: "银",
        dateb: "238",
        datee: "244",
        datez: "",
        mfr: "安蒂奥克造币厂",
        d: "22",
        dz: "",
        w: "4.2",
        desc: "正面是年轻的戈尔迪安三世芒冠像，外围铭文是“最高统帅 凯撒 戈尔迪安 奥古斯都”，背面有多种神像，如阿波罗、胜利女神、远见女神、幸运女神、慷慨女神、英勇之神、朱庇特等。 ",
    },
    {
        sn: "79655",
        loc: "罗马",
        name: "罗马帝国戈尔迪安三世",
        subhead: "1安敦尼银币-幸福女神",
        type: "银",
        dateb: "238",
        datee: "244",
        datez: "",
        mfr: "安蒂奥克造币厂",
        d: "22",
        dz: "",
        w: "4.2",
        desc: "正面是年轻的戈尔迪安三世芒冠像，外围铭文是“最高统帅 凯撒 戈尔迪安 奥古斯都”，背面有多种神像，如阿波罗、胜利女神、远见女神、幸运女神、慷慨女神、英勇之神、朱庇特等。 ",
    },
    {
        sn: "79656",
        loc: "罗马",
        name: "罗马帝国戈尔迪安三世",
        subhead: "1安敦尼银币-罗马女神",
        type: "银",
        dateb: "238",
        datee: "244",
        datez: "",
        mfr: "安蒂奥克造币厂",
        d: "24",
        dz: "",
        w: "4.7",
        desc: "正面是年轻的戈尔迪安三世芒冠像，外围铭文是“最高统帅 凯撒 戈尔迪安 奥古斯都”，背面有多种神像，如阿波罗、胜利女神、远见女神、幸运女神、慷慨女神、英勇之神、朱庇特等。 ",
    },
    {
        sn: "79657",
        loc: "罗马",
        name: "罗马帝国戈尔迪安三世",
        subhead: "1安敦尼银币-喜神星",
        type: "银",
        dateb: "238",
        datee: "244",
        datez: "",
        mfr: "安蒂奥克造币厂",
        d: "22",
        dz: "",
        w: "4.6",
        desc: "正面是年轻的戈尔迪安三世芒冠像，外围铭文是“最高统帅 凯撒 戈尔迪安 奥古斯都”，背面有多种神像，如阿波罗、胜利女神、远见女神、幸运女神、慷慨女神、英勇之神、朱庇特等。 ",
    },
    {
        sn: "79658",
        loc: "罗马",
        name: "罗马帝国戈尔迪安三世",
        subhead: "1安敦尼银币-远见女神",
        type: "银",
        dateb: "238",
        datee: "244",
        datez: "",
        mfr: "安蒂奥克造币厂",
        d: "23.5",
        dz: "",
        w: "4.8",
        desc: "正面是年轻的戈尔迪安三世芒冠像，外围铭文是“最高统帅 凯撒 戈尔迪安 奥古斯都”，背面有多种神像，如阿波罗、胜利女神、远见女神、幸运女神、慷慨女神、英勇之神、朱庇特等。 ",
    },
    {
        sn: "79659",
        loc: "罗马",
        name: "罗马帝国戈尔迪安三世",
        subhead: "1安敦尼银币-协和女神",
        type: "银",
        dateb: "238",
        datee: "244",
        datez: "",
        mfr: "安蒂奥克造币厂",
        d: "22",
        dz: "",
        w: "4.3",
        desc: "正面是年轻的戈尔迪安三世芒冠像，外围铭文是“最高统帅 凯撒 戈尔迪安 奥古斯都”，背面有多种神像，如阿波罗、胜利女神、远见女神、幸运女神、慷慨女神、英勇之神、朱庇特等。 ",
    },
    {
        sn: "79593",
        loc: "拜占庭",
        name: "东罗马帝国皇帝君士坦丁七世与罗曼努斯一世",
        subhead: "1索里德金币",
        type: "金",
        dateb: "913",
        datee: "959",
        datez: "",
        mfr: "未知",
        d: "19.5",
        dz: "",
        w: "4.3",
        desc: "正面为耶稣基督像，外圈拉丁文“IhS XPS RE RESNANTIɥM”（耶稣基督 王中之王）；背面为皇帝君士坦丁七世与罗曼努斯一世手持十字架像，币文“CON Sτ ANτCEROMbh AɥƧƧIA”（君士坦丁与罗曼努斯 奥古斯都们）。正面用耶稣基督像，其用意就是为了强调基督教身份的认同，表明帝国正在得到上帝的庇护。 ",
    },
    {
        sn: "79594",
        loc: "拜占庭",
        name: "威尼斯总督1杜卡特金币（拜占庭风格延续）",
        subhead: "",
        type: "金",
        dateb: "1301",
        datee: "1400",
        datez: "世纪",
        mfr: "未知",
        d: "20.5",
        dz: "",
        w: "3.4",
        desc: "正面为手持福音书的圣马可把十字架顶的权杖授予跪拜在地的威尼斯总督；背面为耶稣手持福音书立于五角星内，币文“REGISISTE DVCASITTXPE DATOTV”（基督啊，让这个您统治的公国献身于您）。威尼斯杜卡特开始发行于公元13世纪末，当时拜占庭的迈克尔八世降低了拜占庭金币的成色。作为应对，威尼斯共和国发行这种金币，直径20毫米，重约3.5克，含金量高达99.5%，是中世纪能达到的最高的黄金纯度。该金币取代了拜占庭金币，成为了欧洲最权威的硬通货。 ",
    },
    {
        sn: "79595",
        loc: "拜占庭",
        name: "东罗马帝国君士坦斯二世与君士坦丁四世",
        subhead: "1索里德金币",
        type: "金",
        dateb: "641",
        datee: "668",
        datez: "",
        mfr: "君士坦丁堡造币厂",
        d: "20",
        dz: "",
        w: "4.5",
        desc: "正面为皇帝君士坦斯二世与君士坦丁四世头像。背面为希拉克略与提比略站像和十字架，币文是“VICTORIA AVƧɥH”（胜利 奥古斯都们 第8作坊）；下方“CON OB”（君士坦丁堡 赤金）。 ",
    },
    {
        sn: "79596",
        loc: "拜占庭",
        name: "东罗马帝国阿纳斯塔修斯",
        subhead: "1索里德金币",
        type: "金",
        dateb: "491",
        datee: "518",
        datez: "",
        mfr: "君士坦丁堡造币厂",
        d: "20",
        dz: "",
        w: "4.1",
        desc: "正面为皇帝阿纳斯塔修斯头像，外圈币文“DN ANIASTASIVS PP AVG”（我主 阿纳斯塔修斯 永恒 奥古斯都）；背面为胜利女神手持长十字架，币文“VICTORIA AVGGG I”（胜利 奥古斯都们 第10作坊）；下方“CON OB”（君士坦丁堡 赤金）。 ",
    },
    {
        sn: "79597",
        loc: "拜占庭",
        name: "东罗马帝国查士丁尼一世",
        subhead: "1索里德金币",
        type: "金",
        dateb: "527",
        datee: "565",
        datez: "",
        mfr: "君士坦丁堡造币厂",
        d: "20",
        dz: "",
        w: "4.2",
        desc: "正面皇帝查士丁尼一世身着军装，手持十字架宝球像，外圈拉丁币文“DN IVSTINIANVS PP AVG”（我主 查士丁尼 永恒 奥古斯都）；背面守护神安淑莎右手扶长十字架，左手托十字球，币文“VICTORIA AVGGG B”（胜利 奥古斯都们 第2作坊）；下方“CON OB”（君士坦丁堡 赤金）。查士丁尼一世，东罗马帝国皇帝。在他治下，东罗马帝国收复许多失地、重建圣索菲亚教堂并编纂《查士丁尼法典》。后人称他的统治为“拜占庭帝国黄金时代”，他也被称为查士丁尼大帝。 ",
    },
    {
        sn: "79598",
        loc: "拜占庭",
        name: "东罗马帝国查士丁一世",
        subhead: "1索里德金币",
        type: "金",
        dateb: "518",
        datee: "527",
        datez: "",
        mfr: "君士坦丁堡造币厂",
        d: "19.5",
        dz: "",
        w: "4.2",
        desc: "正面为查士丁一世头像，外圈拉丁币文“DN IVSINVS PP AVG”（我主 查士丁 永恒 奥古斯都）；背面为守护神安淑莎站像，币文“VICTORIA AVGGG I”（胜利 奥古斯都们 第10作坊）；下方“CON OB”（君士坦丁堡 赤金）。 ",
    },
    {
        sn: "79599",
        loc: "拜占庭",
        name: "东罗马帝国君士坦丁四世",
        subhead: "1索里德金币",
        type: "金",
        dateb: "674",
        datee: "681",
        datez: "",
        mfr: "君士坦丁堡造币厂",
        d: "18.5",
        dz: "",
        w: "4.4",
        desc: "正面为君士坦丁四世头戴羽冠，手持长矛和盾牌像。背面为希拉克略与提比略站像和十字架，币文是“VICTORIA AVƧɥ△”（胜利 奥古斯都们 第4作坊）；下方“CON OB”（君士坦丁堡 赤金）。 ",
    },
    {
        sn: "79600",
        loc: "拜占庭",
        name: "东罗马帝国福卡斯",
        subhead: "1索里德金币",
        type: "金",
        dateb: "602",
        datee: "610",
        datez: "",
        mfr: "君士坦丁堡造币厂",
        d: "20.5",
        dz: "",
        w: "4.5",
        desc: "正面为皇帝福卡斯手持十字架宝球正面像，外环拉丁文“dN FOCAS PERP AVI”（我主 福卡斯 永恒 奥古斯都）。背面守护神安淑莎持十字架球和长十字架，币文是“VICTORIA AVGG I”（胜利 奥古斯都们 第10作坊）；下方“CON OB”（君士坦丁堡 赤金）。 ",
    },
    {
        sn: "79601",
        loc: "拜占庭",
        name: "东罗马帝国希拉克略与君士坦丁三世与希赫拉克罗洛纳斯",
        subhead: "1索里德金币",
        type: "金",
        dateb: "610",
        datee: "641",
        datez: "",
        mfr: "君士坦丁堡造币厂",
        d: "21",
        dz: "",
        w: "4.3",
        desc: "正面希拉克略一世和长子希拉克略君士坦丁、次子希拉克罗纳斯三人正面站像，各托十字球。背面骷髅地十字架，左侧为基督符，币文是“VICTORIA AVG ɥH”（胜利 奥古斯都们 第8作坊）；下方“CON OB”（君士坦丁堡 赤金）。 ",
    },
    {
        sn: "79612",
        loc: "波斯",
        name: "阿契美尼德王朝1大流克金币",
        type: "金",
        dateb: "-490",
        datee: "-400",
        datez: "",
        mfr: "波斯造币厂",
        d: "14.5",
        dz: "",
        w: "8.3",
        desc: "正面为一个年迈的国王头戴芒冠手持弓箭和矛半跪侧面像；背面是不规则凹印。这是世界上所发现最早的帝王像金币。 ",
    },
    {
        sn: "79680",
        loc: "波斯",
        name: "阿契美尼德王朝阿塔薛西斯一世1西格罗斯银币",
        type: "银",
        dateb: "-465",
        datee: "-424",
        datez: "",
        mfr: "未知",
        d: "15.5",
        dz: "",
        w: "5.6",
        desc: "正面为有须国王面右半跪像，头戴芒冠，左手持弓，右手持矛；背面不规则凹印。 ",
    },
    {
        sn: "79681",
        loc: "波斯",
        name: "帕提亚王朝戈尔泽斯二世",
        subhead: "4德拉克马银币",
        type: "银",
        dateb: "46",
        datee: "46",
        datez: "",
        mfr: "未知",
        d: "26.5",
        dz: "",
        w: "14.4",
        desc: "正面正面国王束头带面左胸像。背面瓦尔达尼斯一世面右坐于王座上，右侧堤喀女神左手握丰饶角右手拿花环为国王加冕；币文“ΒΑΣΙΛΕΩΣ ΑΡΣΑΚΟΥ ΕΝΙΦΑΝΟΥΣ ΦΙΛΕΛΛΕΝΟ ΕΥΡΓΕΤΟΥ”（王中之王阿萨克斯 施恩者 正直者 显贵者 爱希腊者）；上中部有字母“HNT”，指塞琉古纪年358年，即公元46年。 ",
    },
    {
        sn: "79682",
        loc: "波斯",
        name: "帕提亚王朝奥罗德斯二世",
        subhead: "4德拉克马银币",
        type: "银",
        dateb: "-57",
        datee: "-38",
        datez: "",
        mfr: "未知",
        d: "29.5",
        dz: "",
        w: "13.7",
        desc: "正面国王束头带面左胸像，背面手持奈克女神和权杖的国王坐像。币文上“ΒΑΣΙΛΕΩΣ ΒΑΣΙΛΕΩΣ”，右“ΑΡΣΑΚΟΥ”，左“ΕΝΙΦΑΝΟΥΣ ΦΙΛΕΛΛΕΝΟ”，下“ΕΥΡΓΕΤΟΥ ΑΡΣΑΚΟΥ”，意为“王中之王阿萨克斯 施恩者 正直者 显贵者 爱希腊者”。 ",
    },
    {
        sn: "79683",
        loc: "波斯",
        name: "埃利迈斯王国",
        subhead: "4德拉克马银币",
        type: "银",
        dateb: "-54",
        datee: "-33",
        datez: "",
        mfr: "帕提亚帝国附属国埃利迈斯王国",
        d: "30",
        dz: "",
        w: "15.2",
        desc: "正面国王卡姆纳斯雷斯五世像；背面中间国王头像，币文模糊。 ",
    },
    {
        sn: "79684",
        loc: "波斯",
        name: "波西斯瓦赫希尔一世",
        subhead: "1奥波银币",
        type: "银",
        dateb: "-90",
        datee: "-60",
        datez: "世纪下半叶末",
        mfr: "未知",
        d: "11",
        dz: "12.5",
        w: "1.8",
        desc: "正面国王瓦赫希尔一世侧面像；背面图案模糊不清。 ",
    },
    {
        sn: "79685",
        loc: "波斯",
        name: "波西斯帕科一世",
        subhead: "1奥波银币",
        type: "银",
        dateb: "-100",
        datee: "-50",
        datez: "世纪上半叶",
        mfr: "未知",
        d: "14",
        dz: "17.5",
        w: "1.7",
        desc: "正面国王帕科一世侧面像；背面三旋纹，币文模糊不清。 ",
    },
    {
        sn: "79686",
        loc: "波斯",
        name: "帕提亚王朝西纳特鲁克斯",
        subhead: "1德拉克马银币",
        type: "银",
        dateb: "-77",
        datee: "-70",
        datez: "",
        mfr: "帕提亚王朝",
        d: "20",
        dz: "",
        w: "4.1",
        desc: "正面国王西纳特鲁克斯侧面像；背面牧人持弓坐像，上下左右希腊文币文，意为“伟大的国王阿萨克斯 爱父亲者 独裁统治者 爱希腊者 显贵者”。 ",
    },
    {
        sn: "79687",
        loc: "波斯",
        name: "帕提亚王朝奥洛加西斯三世",
        subhead: "1德拉克马银币",
        type: "银",
        dateb: "105",
        datee: "147",
        datez: "",
        mfr: "未知",
        d: "18.5",
        dz: "",
        w: "3.9",
        desc: "正面国王奥洛加西斯三世侧面像；背面牧人持弓坐像。 ",
    },
    {
        sn: "79688",
        loc: "波斯",
        name: "帕提亚王朝奥斯罗埃斯二世一德拉克马银币",
        type: "银",
        dateb: "190",
        datee: "190",
        datez: "约",
        mfr: "未知",
        d: "17.5",
        dz: "",
        w: "3.6",
        desc: "正面国王奥斯罗埃斯二世侧面像；背面牧人持弓坐像。 ",
    },
    {
        sn: "79689",
        loc: "波斯",
        name: "帕提亚王朝米特拉达特斯二世",
        subhead: "1德拉克马银币",
        type: "银",
        dateb: "-123",
        datee: "-88",
        datez: "",
        mfr: "未知",
        d: "19.4",
        dz: "",
        w: "3.8",
        desc: "正面国王束头带面左胸；背面牧人持弓面右坐于脐石上，币文左“BAΣIɅEΩΣ”，上“MEΓAɅOY”，右“APΣAKOY”，下“ENIΦANOYΣ”，意为“显贵的阿萨克斯大王”。 ",
    },
    {
        sn: "79690",
        loc: "萨珊",
        name: "萨珊王朝瓦赫兰五世",
        subhead: "1德拉克马银币",
        type: "银",
        dateb: "420",
        datee: "438",
        datez: "",
        mfr: "谋夫造币厂",
        d: "29.5",
        dz: "",
        w: "4.2",
        desc: "正面国王瓦赫兰五世面右胸像，戴球髻新月齿冠；背面祭火台和二祭司，谋夫造币厂标识。 ",
    },
    {
        sn: "79691",
        loc: "萨珊",
        name: "萨珊王朝耶兹格德二世",
        subhead: "1德拉克马银币",
        type: "银",
        dateb: "438",
        datee: "457",
        datez: "",
        mfr: "戈尔甘造币厂",
        d: "28.5",
        dz: "",
        w: "4.1",
        desc: "正面国王耶兹格德二世面右胸像，戴球髻新月齿冠；背面祭火台和二祭司，戈尔甘造币厂标识。 ",
    },
    {
        sn: "79692",
        loc: "萨珊",
        name: "萨珊王朝卑路斯一世",
        subhead: "1德拉克马银币",
        type: "银",
        dateb: "459",
        datee: "484",
        datez: "（卑路斯一世第二次执政时）",
        mfr: "未知",
        d: "25.7",
        dz: "",
        w: "4.2",
        desc: "正面国王面右胸像，戴新月上球髻双翅城齿冠，币文意为“幸运的卑路斯国王”；背面是国王与祭司分站在祭火坛两侧，上部火焰左右有星月纹，右侧造币地铭文，意为“迪拉布格德”。 ",
    },
    {
        sn: "79693",
        loc: "萨珊",
        name: "萨珊王朝卡瓦德一世",
        subhead: "1德拉克马银币",
        type: "银",
        dateb: "499",
        datee: "531",
        datez: "（卡瓦德一世第二次执政时）",
        mfr: "未知",
        d: "29",
        dz: "",
        w: "3.9",
        desc: "正面国王面右胸像，戴新月上球髻双翅城齿冠，币文意为“繁荣昌盛卡瓦德”；背面是国王与祭司分站在祭火坛两侧，上部火焰左右有星月纹，左侧造币纪年“14”，右侧造币地“阿瓦兹”，外缘双珠圈。 ",
    },
    {
        sn: "79694",
        loc: "萨珊",
        name: "萨珊王朝库思老一世",
        subhead: "1德拉克马银币",
        type: "银",
        dateb: "531",
        datee: "579",
        datez: "",
        mfr: "未知",
        d: "29.5",
        dz: "",
        w: "4",
        desc: "正面国王库思老一世面右胸像，戴火焰新月齿冠；背面祭火台和二祭司，左侧造币纪年，右侧造币地简写。 ",
    },
    {
        sn: "79695",
        loc: "萨珊",
        name: "萨珊王朝霍米兹德四世",
        subhead: "1德拉克马银币",
        type: "银",
        dateb: "579",
        datee: "590",
        datez: "",
        mfr: "未知",
        d: "30.5",
        dz: "",
        w: "3.4",
        desc: "正面国王霍米兹德四世面右胸像，戴火焰新月齿冠，两肩上有新月。背面祭火台和二祭司，左侧造币纪年，右侧造币地简写。 ",
    },
    {
        sn: "79696",
        loc: "萨珊",
        name: "萨珊王朝库思老二世1德拉克马银币（长脸版）",
        subhead: "",
        type: "银",
        dateb: "579",
        datee: "590",
        datez: "",
        mfr: "口口造币厂",
        d: "30",
        dz: "",
        w: "4",
        desc: "正面国王库思老二世星月双翅齿冠侧面像，币文是“祝愿库思老繁荣昌盛”。背面祭火台和二祭司，纪年和口口造币厂标识。 ",
    },
    {
        sn: "79697",
        loc: "萨珊",
        name: "萨珊王朝库思老二世1德拉克马银币（短脸版）",
        subhead: "",
        type: "银",
        dateb: "579",
        datee: "590",
        datez: "",
        mfr: "口口造币厂",
        d: "30",
        dz: "",
        w: "4.1",
        desc: "正面国王库思老二世星月双翅齿冠侧面像，币文是“祝愿库思老繁荣昌盛”。背面祭火台和二祭司，纪年和口口造币厂标识。 ",
    },
    {
        sn: "79698",
        loc: "萨珊",
        name: "萨珊王朝库思老二世",
        subhead: "1德拉克马银币",
        type: "银",
        dateb: "591",
        datee: "628",
        datez: "",
        mfr: "未知",
        d: "29.8",
        dz: "",
        w: "4.1",
        desc: "正面国王面右胸像，戴星月双翅城齿冠，币文意为“繁荣昌盛，库思老”，双珠圈外有3个星月纹，右下铭文意为“赞美”。背面是国王与祭司分站在祭火坛两侧，上部火焰左右有星月纹，左侧造币纪年“21”，右侧造币地“哈马丹”，三层珠圈外有4个星月纹。 ",
    },
    {
        sn: "79699",
        loc: "萨珊",
        name: "萨珊王朝阿尔达希尔二世",
        subhead: "1德拉克马银币",
        type: "银",
        dateb: "379",
        datee: "383",
        datez: "",
        mfr: "未知",
        d: "28.8",
        dz: "",
        w: "4.1",
        desc: "正面国王面右胸像，戴球髻圆顶冠，外圈巴列维文，意为“马兹达的崇拜者 伊朗和非伊朗的王中之王 神圣的阿尔达希尔”；背面是国王与祭司分站在祭火坛两侧。 ",
    },
    {
        sn: "79700",
        loc: "萨珊",
        name: "萨珊王朝阿尔达希尔三世",
        subhead: "1德拉克马银币",
        type: "银",
        dateb: "628",
        datee: "630",
        datez: "",
        mfr: "未知",
        d: "35.5",
        dz: "",
        w: "3.9",
        desc: "正面国王阿达希尔三世面右胸像，戴球髻新月齿冠，币文是“祝愿阿尔达希尔繁荣昌盛”；背面祭火台和二祭司，纪年和造币地标识。 ",
    },
    {
        sn: "79701",
        loc: "萨珊",
        name: "阿拉伯—萨珊哈里发·阿布杜拉·伊本祖拜尔",
        subhead: "1德拉克马银币",
        type: "银",
        dateb: "680",
        datee: "692",
        datez: "",
        mfr: "未知",
        d: "29",
        dz: "",
        w: "4.2",
        desc: "银币采用库思老二世版。正面有巴列维文，意为“哈里发·阿布杜拉·伊本祖拜尔”。 ",
    },
    {
        sn: "79702",
        loc: "萨珊",
        name: "嚈迖王朝仿萨珊",
        subhead: "1德拉克马银币",
        type: "银",
        dateb: "401",
        datee: "500",
        datez: "世纪",
        mfr: "未知",
        d: "29",
        dz: "",
        w: "3.5",
        desc: "正面国王戴新月冠面像，头后双飘带；背面为不清楚的两祭司和祭火坛。 ",
    },
    {
        sn: "79703",
        loc: "萨珊",
        name: "巴勒斯坦仿库思老二世",
        subhead: "1德拉克马银币",
        type: "银",
        dateb: "711",
        datee: "731",
        datez: "",
        mfr: "未知",
        d: "23",
        dz: "",
        w: "2.19",
        desc: "null ",
    },
    {
        sn: "79607",
        loc: "古印度",
        name: "寄多罗王朝威格拉哈提婆",
        subhead: "1德拉克马银币",
        type: "金",
        dateb: "401",
        datee: "500",
        datez: "世纪",
        mfr: "克什米尔地区",
        d: "22",
        dz: "",
        w: "7.6",
        desc: "正面抽象化国王站像。背面抽象化的大地神阿多赫索坐像，右侧婆罗米文，意为“吉祥威格拉哈提婆”。低金。 ",
    },
    {
        sn: "79609",
        loc: "古印度",
        name: "查拉健王朝拉其普特金币",
        type: "金",
        dateb: "1145",
        datee: "1171",
        datez: "",
        mfr: "未知",
        d: "14.5",
        dz: "",
        w: "4.1",
        desc: "正面为四臂吉祥天女盘腿坐像，背面是3行天城体梵文。 ",
    },
    {
        sn: "79610",
        loc: "古印度",
        name: "卡拉秋里王朝耿吉亚提婆金币",
        type: "金",
        dateb: "1015",
        datee: "1041",
        datez: "",
        mfr: "未知",
        d: "15.5",
        dz: "",
        w: "4.1",
        desc: "正面为吉祥天女坐像；背面为3行天城体梵文，意为“斯里 耿吉亚 提婆”。 ",
    },
    {
        sn: "79611",
        loc: "古印度",
        name: "章德拉王朝萨拉克夏纳瓦尔曼1标准金币",
        type: "金",
        dateb: "1097",
        datee: "1110",
        datez: "",
        mfr: "未知",
        d: "16.5",
        dz: "",
        w: "4.2",
        desc: "正面是四臂吉祥天女盘腿坐像；背面是3行天城体梵文，意为“斯里 萨拉克 夏纳瓦尔曼 提婆”。 ",
    },
    {
        sn: "79704",
        loc: "古印度",
        name: "古印度早期印记银币（50枚）",
        type: "银",
        dateb: "-324",
        datee: "-187",
        datez: "",
        mfr: "印度北方",
        d: "3.1",
        dz: "3.2",
        w: "159",
        desc: "公元前6世纪列国时代，古印度北方就开始打制本土银币，这些银币形状随意，没有文字，只有印记。之后的摩揭陀王朝、难陀王朝、孔雀王朝、巽加王朝及以后一些王朝都打制这种银币，前后有四五百年。 ",
    },
    {
        sn: "79705",
        loc: "古印度",
        name: "古印度西萨特拉普王朝1德拉克马银币（10枚）",
        type: "银",
        dateb: "-30",
        datee: "395",
        datez: "",
        mfr: "西萨特拉普王朝",
        d: "14",
        dz: "",
        w: "2.29",
        desc: "正面国王头像和纪年，背面三拱佛丘，日月及河流及婆罗米文。 ",
    },
    {
        sn: "79706",
        loc: "古印度",
        name: "古印度吉拉特查拉健王朝1德拉克马银币（10枚）",
        type: "银",
        dateb: "800",
        datee: "1300",
        datez: "",
        mfr: "吉拉特查拉健王朝",
        d: "15",
        dz: "",
        w: "4.1",
        desc: "正面简化的印度-萨珊国王头像，上有日月图案。背面为极为简化的祭火坛，上方有星月图案。 ",
    },
    {
        sn: "79707",
        loc: "古印度",
        name: "古印度沙希王朝1德拉克马银币（4枚之一）",
        type: "银",
        dateb: "850",
        datee: "1026",
        datez: "",
        mfr: "未知",
        d: "17.5",
        dz: "",
        w: "3.2",
        desc: "正面国王持矛骑马右行像。背面左向卧着的瘤牛，臀部有徽记。 ",
    },
    {
        sn: "79708",
        loc: "古印度",
        name: "古印度沙希王朝1德拉克马银币（4枚之一）",
        type: "银",
        dateb: "850",
        datee: "1026",
        datez: "",
        mfr: "未知",
        d: "17.5",
        dz: "",
        w: "3.2",
        desc: "正面国王持矛骑马右行像。背面左向卧着的瘤牛，臀部有徽记。 ",
    },
    {
        sn: "79709",
        loc: "古印度",
        name: "古印度沙希王朝1德拉克马银币（4枚之一）",
        type: "银",
        dateb: "850",
        datee: "1026",
        datez: "",
        mfr: "未知",
        d: "17.5",
        dz: "",
        w: "3.2",
        desc: "正面国王持矛骑马右行像。背面左向卧着的瘤牛，臀部有徽记。 ",
    },
    {
        sn: "79710",
        loc: "古印度",
        name: "古印度沙希王朝1德拉克马银币（4枚之一）",
        type: "银",
        dateb: "850",
        datee: "1026",
        datez: "",
        mfr: "未知",
        d: "17.5",
        dz: "",
        w: "3.2",
        desc: "正面国王持矛骑马右行像。背面左向卧着的瘤牛，臀部有徽记。 ",
    },
    {
        sn: "79602",
        loc: "伊斯兰",
        name: "卡尔吉王朝穆罕默德二世1天罡金币",
        type: "金",
        dateb: "1296",
        datee: "1316",
        datez: "",
        mfr: "未知",
        d: "24.4",
        dz: "",
        w: "11",
        desc: "正面、背面铭文为古兰经经文以及穆罕默德二世头衔。穆罕默德二世，原名阿拉乌德丁·卡吉尔，德里苏丹国卡尔吉王朝第二任苏丹。 ",
    },
    {
        sn: "79603",
        loc: "伊斯兰",
        name: "莫卧尔王朝沙·阿拉姆二世1莫卧尔金币",
        type: "金",
        dateb: "1759",
        datee: "1806",
        datez: "",
        mfr: "斋普尔",
        d: "26",
        dz: "",
        w: "10.9",
        desc: "正面、背面铭文为赞词以及“阿拉姆”名讳。沙·阿拉姆二世，莫卧尔帝国的第十五任君王。在位期间，莫卧尔王国被东印度公司控制。 ",
    },
    {
        sn: "79604",
        loc: "伊斯兰",
        name: "伊尔汗国不赛因2第纳尔金币",
        type: "金",
        dateb: "1316",
        datee: "1335",
        datez: "",
        mfr: "未知",
        d: "25.5",
        dz: "",
        w: "8.3",
        desc: "正面、背面铭文为古兰经经文和打制年份。不赛因是伊尔汗国最后一位统一大汗，之后伊尔汗国分裂为五个小王朝互相攻伐，汗国逐渐灭亡。 ",
    },
    {
        sn: "79605",
        loc: "伊斯兰",
        name: "阿尤布王朝卡米勒一世",
        subhead: "1德拉克马银币",
        type: "金",
        dateb: "1219",
        datee: "1238",
        datez: "",
        mfr: "开罗造币厂",
        d: "21.5",
        dz: "",
        w: "4.4",
        desc: "正面中央四行铭文为卡米勒一世的全名，周围铭文为“以真主的名义 富有同情心的 仁慈的 打制于回历626年”。背面中心四行铭文为伊斯兰教第五十四代哈里发——阿拔斯王朝的穆斯坦绥尔的全名，外圈铭文为“以正道和真教的名义，委托他的使者，以便他使真教胜过一切宗教，即使以物配主者不愿意”。阿尤布王朝埃及苏丹卡米勒一世，本名卡米勒·穆罕默德，是阿迪力一世之子，公元1219～1238年在位，是埃及的第四位阿尤布苏丹。 ",
    },
    {
        sn: "79606",
        loc: "伊斯兰",
        name: "阿拔斯王朝马赫迪",
        subhead: "1德拉克马银币",
        type: "金",
        dateb: "775",
        datee: "785",
        datez: "",
        mfr: "未知",
        d: "18.5",
        dz: "",
        w: "4.1",
        desc: "正面、背面铭文为古兰经经文和打制年份。阿尔·马赫迪，伊斯兰教第二十一代哈里发，阿拔斯王朝第三代哈里发，第二代哈里发曼苏尔一世之子。 ",
    },
    {
        sn: "79608",
        loc: "伊斯兰",
        name: "帖木儿帝国金币",
        type: "金",
        dateb: "1370",
        datee: "1507",
        datez: "",
        mfr: "未知",
        d: "5.1",
        dz: "",
        w: "0.9",
        desc: "null ",
    },
    {
        sn: "79711",
        loc: "伊斯兰",
        name: "德里苏丹国卡尔吉王朝费鲁兹沙二世1天罡银币",
        type: "银",
        dateb: "1290",
        datee: "1296",
        datez: "",
        mfr: "未知",
        d: "27.1",
        dz: "",
        w: "10.9",
        desc: "正面、背面铭文为古兰经经文以及费鲁兹沙的头衔“第二个亚历山大”。费鲁兹沙，原名菲鲁兹·卡尔基是卡尔吉王朝第一任国王。 ",
    },
    {
        sn: "79712",
        loc: "伊斯兰",
        name: "德里苏丹国卡尔吉王朝穆罕默德二世1天罡银币",
        type: "银",
        dateb: "1296",
        datee: "1316",
        datez: "",
        mfr: "未知",
        d: "26.9",
        dz: "",
        w: "10.9",
        desc: "正面、背面铭文为古兰经经文以及穆罕默德二世头衔。 ",
    },
    {
        sn: "79713",
        loc: "伊斯兰",
        name: "莫卧儿帝国孟加拉管辖区阿拉姆1卢比银币",
        type: "银",
        dateb: "1801",
        datee: "1830",
        datez: "世纪初",
        mfr: "未知",
        d: "23",
        dz: "",
        w: "11.3",
        desc: "正面、背面铭文为赞词、“阿拉姆”名讳以及鱼和花形图案。这种币虽然以莫卧尔的阿拉姆头衔打制，但公元1806年阿拉姆逝世后依旧在以他的头衔打制。 ",
    },
    {
        sn: "79714",
        loc: "伊斯兰",
        name: "印度印多尔邦西瓦吉·罗1卢比银币",
        type: "银",
        dateb: "1886",
        datee: "1903",
        datez: "",
        mfr: "未知",
        d: "19.5",
        dz: "",
        w: "11.3",
        desc: "正面为那伽利文铭文和太阳脸图案，背面铭文为“西瓦吉·罗”名讳及打制年份。印多尔邦位于印度中部，公元1728年由玛拉特联盟荷尔卡家族马尔哈·罗一世立国。公元1949年，并入印度。 ",
    },
    {
        sn: "79717",
        loc: "伊斯兰",
        name: "印度库奇邦银币（2枚之一）",
        type: "银",
        dateb: "1701",
        datee: "1800",
        datez: "世纪",
        mfr: "未知",
        d: "14",
        dz: "",
        w: "4.6",
        desc: "null ",
    },
    {
        sn: "79718",
        loc: "伊斯兰",
        name: "印度库奇邦银币（2枚之一）",
        type: "银",
        dateb: "1701",
        datee: "1800",
        datez: "世纪",
        mfr: "未知",
        d: "15",
        dz: "",
        w: "5.7",
        desc: "null ",
    },
    {
        sn: "79719",
        loc: "伊斯兰",
        name: "倭马亚王朝希沙姆1迪尔汗银币",
        type: "银",
        dateb: "724",
        datee: "743",
        datez: "",
        mfr: "瓦斯特",
        d: "26",
        dz: "",
        w: "2.9",
        desc: "正面、背面铭文为古兰经经文和打制年份。希沙姆一世，伊斯兰教第十四代哈里发，也是阿拉伯帝国倭马亚王朝第十代哈里发。 ",
    },
    {
        sn: "79721",
        loc: "伊斯兰",
        name: "加兹尼王朝小银币（30枚）",
        type: "银",
        dateb: "962",
        datee: "1186",
        datez: "",
        mfr: "未知",
        d: "9",
        dz: "",
        w: "0.5",
        desc: "null ",
    },
    {
        sn: "79722",
        loc: "伊斯兰",
        name: "杜兰尼王朝1卢比银币",
        type: "银",
        dateb: "1747",
        datee: "1842",
        datez: "",
        mfr: "未知",
        d: "22",
        dz: "",
        w: "10.6",
        desc: "null ",
    },
    {
        sn: "79723",
        loc: "伊斯兰",
        name: "阿夫沙尔王朝沙鲁克2卢比银币",
        type: "银",
        dateb: "1748",
        datee: "1796",
        datez: "",
        mfr: "马什哈德",
        d: "24",
        dz: "",
        w: "23",
        desc: "正面铭文为二言诗，背面铭文为祝福语。 ",
    },
    {
        sn: "79724",
        loc: "伊斯兰",
        name: "阿拔斯王朝马蒙·阿卜杜拉1迪尔汗银币",
        type: "银",
        dateb: "813",
        datee: "833",
        datez: "",
        mfr: "和平之城（巴格达）",
        d: "24",
        dz: "",
        w: "2.8",
        desc: "正面、背面铭文为古兰经经文和打制年份。马蒙·阿卜杜拉，阿拉伯帝国阿拔斯王朝第七任哈里发。 ",
    },
    {
        sn: "79725",
        loc: "伊斯兰",
        name: "帖木儿帝国天罡银币",
        type: "银",
        dateb: "1370",
        datee: "1507",
        datez: "",
        mfr: "未知",
        d: "19",
        dz: "",
        w: "5.2",
        desc: "null ",
    },
    {
        sn: "79615",
        loc: "希腊",
        name: "古希腊西利西亚地区城邦宙斯铜币",
        type: "铜",
        dateb: "-100",
        datee: "-1",
        datez: "世纪",
        mfr: "未知",
        d: "null",
        dz: "",
        w: "null",
        desc: "null ",
    },
    {
        sn: "79616",
        loc: "罗马",
        name: "君士坦丁王朝铜币（君士坦丁一世）",
        type: "铜",
        dateb: "307",
        datee: "364",
        datez: "",
        mfr: "未知",
        d: "null",
        dz: "",
        w: "null",
        desc: "null ",
    },
    {
        sn: "79617",
        loc: "罗马",
        name: "君士坦丁王朝铜币（君士坦丁乌斯一世）",
        type: "铜",
        dateb: "307",
        datee: "364",
        datez: "",
        mfr: "未知",
        d: "null",
        dz: "",
        w: "null",
        desc: "null ",
    },
    {
        sn: "79618",
        loc: "罗马",
        name: "君士坦丁王朝铜币（君士坦丁二世）",
        type: "铜",
        dateb: "307",
        datee: "364",
        datez: "",
        mfr: "未知",
        d: "null",
        dz: "",
        w: "null",
        desc: "null ",
    },
    {
        sn: "79619",
        loc: "罗马",
        name: "君士坦丁王朝铜币（君士坦斯）",
        type: "铜",
        dateb: "307",
        datee: "364",
        datez: "",
        mfr: "未知",
        d: "null",
        dz: "",
        w: "null",
        desc: "null ",
    },
    {
        sn: "79620",
        loc: "罗马",
        name: "君士坦丁王朝铜币（君士坦斯乌斯二世）",
        type: "铜",
        dateb: "307",
        datee: "364",
        datez: "",
        mfr: "未知",
        d: "null",
        dz: "",
        w: "null",
        desc: "null ",
    },
    {
        sn: "79621",
        loc: "罗马",
        name: "古罗马“母狼乳婴”铜币",
        type: "铜",
        dateb: "-700",
        datee: "-601",
        datez: "世纪",
        mfr: "未知",
        d: "null",
        dz: "",
        w: "null",
        desc: "null ",
    },
    {
        sn: "79715",
        loc: "古中亚",
        name: "印度一希腊王朝阿波罗·多托斯时期瘤牛银币",
        type: "银",
        dateb: "-186",
        datee: "-160",
        datez: "",
        mfr: "未知",
        d: "15.5",
        dz: "",
        w: "2.2",
        desc: "null ",
    },
    {
        sn: "79716",
        loc: "古中亚",
        name: "印度一塞克王朝斯帕拉雷西斯时期银币",
        type: "银",
        dateb: "-65",
        datee: "-45",
        datez: "",
        mfr: "未知",
        d: "17",
        dz: "",
        w: "1.9",
        desc: "null ",
    },
    {
        sn: "79720",
        loc: "古中亚",
        name: "西徐亚王朝银币",
        type: "银",
        dateb: "-35",
        datee: "-5",
        datez: "",
        mfr: "未知",
        d: "24",
        dz: "",
        w: "8.7",
        desc: "null ",
    },
];

const imgDataList = reactive([])
const imgLenth = ref(12)
const dialogVisible = ref(false)

onMounted(() => {
    dataList.slice(0, imgLenth.value).forEach((i) => {
        imgDataList.push(i)
    })
})
onUpdated(() => {

    setTimeout(() => {
        if (dataList.length != 0 && pushTrue.value) {
            dataList.slice(0, imgLenth.value + 12).forEach((i) => {
                imgDataList.push(i)
            })
            imgLenth.value = imgLenth.value + 12
        } else {
            pushTrue.value = false
        }
    }, 2000);

})
const isFront = ref(true)
const closeDialog = () => {
    dialogVisible.value = false
}
const fliterImg = ref({})
const imgInfo = (id) => {
    fliterImg.value = id
    dialogVisible.value = true
}
const checkBtn = (value) => {
    isFront.value = value
}
</script>
    
<style lang="scss" scoped>
@import url('@/assets/font.css');

.main_bg {
    background-image: url('@/assets/nav/index-bg.png');
    background-size: 100% 100%;
    width: 100%;
    height: calc(100vh - 2.5em);
    margin-top: -1px;
    left: 0;
    clear: both;
    position: absolute;
    top: 1.8em;

    .leftConten {
        width: 9.08em;
        height: 5.52em;
        background-image: url('@/assets/all/paper.png');
        background-size: 100% 100%;
        margin-top: 1.3em;
        margin-left: 0.5em;
        display: flex;

        .retrieval {

            width: 5.9em;
            // border: 1px solid red;
            margin: 0.1em 0.2em;
            top: 0;

            .ancient {
                color: white;
                padding: 0;
                left: 0;
                line-height: 12pt;

                h5 {

                    font-family: syBlod;
                    font-size: 0.3em;
                    padding: 0;
                    // margin:  0;
                    margin-left: 10px;
                    margin-bottom: 0;

                }

                >span {
                    cursor: pointer;
                    // height: 10px;
                    font-family: syBlod;
                    // width: 3em;
                    // display: inline-block;
                    margin-left: 10px;
                    padding-right: 10px;
                    border-right: 3px solid white;
                    font-size: 0.3em;
                }

                >span:first {
                    margin-left: 0;
                }

            }
        }

        .active {
            // width: 100px;
            color: black;
            background-color: #f8921e;
            background-size: 100px 100px;

        }
    }

    .rightConten {
        width: 11.97em;
        height: 7.0em;
        background-image: url('@/assets/all/paper_right.png');
        background-size: 100% 100%;
        // float:right;
        position: absolute;
        top: -0.75em;
        right: 0.5em; // left: 0;
        z-index: 99;

        .imgData {
            cursor: pointer;
            width: 90%;
            height: 6em;
            overflow-y: scroll;
            margin: auto;
            margin-top: 0.72em;

            .imgBox {
                float: left;


                width: 2em;
                height: 2em;
                // float: left;
                margin-left: 0.5em;
                // display: block;

                >img {
                    // display: block;
                    width: 100%;
                    height: 100%;
                }
            }
        }
    }
}

.dialog {
    border: 1px solid;
    width: 100vw;
    height: 100vh;
    position: absolute;
    top: 0;
    left: 0;
    z-index: 999;
    background-color: rgba(1, 1, 0, 0.418);

    .dialog_bg {
        background-image: url('@/assets/all/paper.png');
        background-size: 100% 100%;
        width: 13.91em;
        height: 7em;
        position: relative;
        z-index: 10;
        transform: translate(-50%, -50%);
        top: 50%;
        left: 50%;

        .dialogclose {
            background-image: url('@/assets/distribution/back_btn.png');
            background-size: 100% 100%;
            width: 1.28em;
            height: 1.28em;
            z-index: 11;
            position: absolute;
            left: 94%;
            top: 0.55em;
            cursor: pointer;
        }

        .dialog_content {
            width: 99%;
            height: 8.43em;
            overflow: hidden;
            margin: 0 auto;
            // padding-top: 0.7em;
            display: flex;

            .left_img_box {
                // border: 1px solid red;
                width: 6em;
                height: 7em;
                margin-left: 1.1em;
                margin-top: 0.6em;
                // border: 1px solid red;

                .left_imgs {
                    >img {
                        width: 500px;
                        height: 500px;
                    }
                }

                .reduce {
                    width: 3em;
                    // border: 1px solid red;
                    margin: 0 auto;
                    display: flex;
                    justify-self: center;

                    .img {
                        cursor: pointer;
                        margin-left: 30px;
                        // display: inline-block;
                        width: 0.72em;
                        height: 0.72em;
                        border: #383838 4px solid;

                        >img {
                            display: block;
                            width: 0.72em;
                            height: 0.72em;
                            background-color: #383838;

                        }
                    }

                    .img:before {
                        content: "";
                        position: absolute;
                        width: 0.72em;
                        height: 0.72em;
                        background-color: rgba(0, 0, 0, 0.8);
                        opacity: 0;
                        transition: opacity .5s;
                        opacity: 1;
                    }

                    .active {
                        border: #f8921e 4px solid;
                    }

                    .active.img:before {
                        opacity: 0;
                    }

                }


            }

            .right_content {
                height: 7em;
                width: 6em;


                .form {
                    margin-top: 0.7em;
                    width: 90%;
                    height: 2.5em;

                    .form_item {
                        margin-top: 0.3em;
                        height: 30px;
                        display: block;
                        width: 50%;
                        float: left;

                        >a {
                            float: left;
                            display: block;
                            font-size: 0.2em;
                        }

                        .icon {
                            float: left;
                            width: 0.26em;
                            height: 0.26em;
                            background-image: url('@/assets/all/icon.png');
                            display: block;
                            margin-right: 10px;
                        }

                        .number {
                            background-position: 0.66em 0em;
                        }

                        .loc {
                            background-position: 0.66em 0.26em;
                        }

                        .mfr {
                            background-position: 0.26em 0em;
                        }

                        .type {
                            width: 0.28em;
                            height: 0.28em;
                            background-position: -0.41em 0.0em;
                        }

                        .d {
                            width: 0.28em;
                            height: 0.28em;
                            background-position: -0.41em 0.28em;
                        }

                        .w {
                            width: 0.28em;
                            height: 0.28em;
                            background-position: 0 0;
                        }
                    }


                }

                .nameBox {
                    clear: both;
                    height: 1.51em;
                    width: 5.79em;
                    background-image: url('@/assets/all/name-tag.png');
                    background-size: contain;
                    margin: 0.3em 0;

                    .text {
                        width: 99%;
                        margin-left: 0.3em;
                        >h3 {
                            width: 100%;
                            display: block;
                            padding-top: 1em;
                            font-size: 0.3em;
                            font-family: syBlod;
                            height: 0.65em;
                        }

                        >h5 {

                            display: block;
                            margin: 0;
                            font-size: 0.24em;
                            line-height: 1.8em;
                            font-family: syBlod;
                        }
                    }

                }

                .descBox {
                    clear: both;

                    font-size: 0.2em;
                }
            }

        }

    }


}
</style>